Revit 2024 API
PointOnCurveMeasureFrom Enumeration
 Point on curve MeasureFrom - It tells from which end of the host curve the point location is measured.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Since: 2012
Syntax
C#
public enum PointOnCurveMeasureFrom
Visual Basic
Public Enumeration PointOnCurveMeasureFrom
Visual C++
public enum class PointOnCurveMeasureFrom
Members
Member name | Description
Beginning |  Beginning of the host curve.
End |  End of the host curve.
See Also
Autodesk.Revit.DB Namespace